dataset_gen/Earlier_Datasets/Hole_Location_Change/NS_Gauss_openfoam/Design_Point_0/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

// Define vertices for the 8 blocks
vertices
(
    // Bottom-left corner
    (0       0       0)     // 0
    (0.46875 0       0)     // 1
    (0.46875 0.46875 0)     // 2
    (0       0.46875 0)     // 3
    (0       0       0.1)   // 4
    (0.46875 0       0.1)   // 5
    (0.46875 0.46875 0.1)   // 6
    (0       0.46875 0.1)   // 7

    // Bottom-right corner
    (0.53125 0       0)     // 8
    (1       0       0)     // 9
    (1       0.46875 0)     // 10
    (0.53125 0.46875 0)     // 11
    (0.53125 0       0.1)   // 12
    (1       0       0.1)   // 13
    (1       0.46875 0.1)   // 14
    (0.53125 0.46875 0.1)   // 15

    // Top-left corner
    (0       0.53125 0)     // 16
    (0.46875 0.53125 0)     // 17
    (0.46875 1       0)     // 18
    (0       1       0)     // 19
    (0       0.53125 0.1)   // 20
    (0.46875 0.53125 0.1)   // 21
    (0.46875 1       0.1)   // 22
    (0       1       0.1)   // 23

    // Top-right corner
    (0.53125 0.53125 0)     // 24
    (1       0.53125 0)     // 25
    (1       1       0)     // 26
    (0.53125 1       0)     // 27
    (0.53125 0.53125 0.1)   // 28
    (1       0.53125 0.1)   // 29
    (1       1       0.1)   // 30
    (0.53125 1       0.1)   // 31
);

// Define blocks
blocks
(
    hex (0  1  2  3  4  5  6  7) (60 60 1) simpleGrading (1 1 1) // Bottom-left
    hex (8  9  10 11 12 13 14 15) (60 60 1) simpleGrading (1 1 1) // Bottom-right
    hex (16 17 18 19 20 21 22 23) (60 60 1) simpleGrading (1 1 1) // Top-left
    hex (24 25 26 27 28 29 30 31) (60 60 1) simpleGrading (1 1 1) // Top-right
    hex (1  8  11 2  5  12 15 6)  (8 60 1)  simpleGrading (1 1 1) // Bottom-center
    hex (17 24 27 18 21 28 31 22) (8 60 1)  simpleGrading (1 1 1) // Top-center
    hex (3  2  17 16 7  6  21 20) (60 8 1)  simpleGrading (1 1 1) // Left-center
    hex (11 10 25 24 15 14 29 28) (60 8 1)  simpleGrading (1 1 1) // Right-center
);

// Boundary definitions
boundary
(
    left
    {
        type            cyclic;
        neighbourPatch  right;
        faces
        (
            (0 4 7 3)
            (3 7 20 16)
            (16 20 23 19)
        );
    }
    right
    {
        type            cyclic;
        neighbourPatch  left;
        faces
        (
            (9 13 14 10)
            (10 14 29 25)
            (25 29 30 26)
        );
    }
    bottom
    {
        type            cyclic;
        neighbourPatch  top;
        faces
        (
            (0 1 5 4)
            (1 8 12 5)
            (8 9 13 12)
        );
    }
    top
    {
        type            cyclic;
        neighbourPatch  bottom;
        faces
        (
            (18 19 23 22)
            (27 18 22 31)
            (26 27 31 30)
        );
    }
    holeWalls
    {
        type wall;
        faces
        (
            (2 17 21 6)        // Front face
            (15 28 24 11)      // Right face
            (6 15 11 2)        // Bottom face
            (21 28 24 17)      // Top face
        );
    }

    frontAndBack
    {
        type            empty;
        faces
        (
            // Front faces (z = 0)
            (0 3 2 1)      // Bottom-left block
            (8 11 10 9)    // Bottom-right block
            (16 19 18 17)  // Top-left block
            (24 27 26 25)  // Top-right block
            (1 2 11 8)     // Bottom-center block
            (17 18 27 24)  // Top-center block
            (3 16 17 2)    // Left-center block
            (11 24 25 10)   // Right-center block

            // Back faces (z = 0.1)
            (4 7 6 5)      // Bottom-left block
            (12 15 14 13)  // Bottom-right block
            (20 23 22 21)  // Top-left block
            (28 31 30 29)  // Top-right block
            (5 6 15 12)    // Bottom-center block
            (21 22 31 28)  // Top-center block
            (7 20 21 6)    // Left-center block
            (15 28 29 14)   // Right-center block
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
